Repository: lumanya/dm-dev
Catalog: pages/locale/*/LC_MESSAGES/django.po
Languages: de, fr, sw

source: Improving Access to Medicines in Africa
de: Verbesserung des Zugangs zu Medikamenten in Afrika
fr: Améliorer l'accès aux médicaments en Afrique
sw: Kuboresha Upatikanaji wa Dawa Barani Afrika

source: Who We Are
de: Wer wir sind
fr: Qui Nous Sommes
sw: Sisi ni Nani

source: Dawa Mkononi is focused on using innovation to improve the supply chain. Dawa Mkononi's operations mainly target pharmacies, health facilities, and other registered B2B clients. With its data-driven approaches, we have a mission of improving access to medicine distribution and making medicines more available to health facilities.
de: Dawa Mkononi konzentriert sich darauf, Innovationen zu nutzen, um die Lieferkette zu verbessern. Die Aktivitäten von Dawa Mkononi richten sich hauptsächlich an Apotheken, Gesundheitseinrichtungen und andere registrierte B2B-Kunden. Mit datenbasierten Ansätzen verfolgen wir die Mission, den Zugang zur Medikamentenverteilung zu verbessern und Medikamente für Gesundheitseinrichtungen verfügbarer zu machen.
fr: Dawa Mkononi se concentre sur l'utilisation de l'innovation pour améliorer la chaîne d'approvisionnement. Les opérations de Dawa Mkononi ciblent principalement les pharmacies, les établissements de santé et d'autres clients B2B enregistrés. Avec ses approches basées sur les données, nous avons pour mission d'améliorer la distribution de médicaments et de rendre les médicaments plus accessibles aux établissements de santé.
sw: Dawa Mkononi inalenga kutumia ubunifu kuboresha mnyororo wa usambazaji. Shughuli za Dawa Mkononi zinalenga zaidi maduka ya dawa, vituo vya afya, na wateja wengine waliosajiliwa wa B2B. Kwa mbinu zake zinazoongozwa na data, tuna lengo la kuboresha usambazaji wa dawa na kuzifanya zipatikane zaidi kwa vituo vya afya.

source: Dawa Mkononi is a product of DMRX Inc., a United States of America-based Company. DMRX Inc. is the holding company of DMRX Company Limited, a company incorporated in Tanzania.
de: Dawa Mkononi ist ein Produkt von DMRX Inc., einem Unternehmen mit Sitz in den Vereinigten Staaten von Amerika. DMRX Inc. ist die Muttergesellschaft von DMRX Company Limited, einem Unternehmen, das in Tansania eingetragen ist.
fr: Dawa Mkononi est un produit de DMRX Inc., une entreprise basée aux États-Unis. DMRX Inc. est la société mère de DMRX Company Limited, une société incorporée en Tanzanie.
sw: Dawa Mkononi ni bidhaa ya DMRX Inc., Kampuni inayotegemea Marekani. DMRX Inc. ni kampuni mama ya DMRX Company Limited, kampuni iliyosajiliwa Tanzania.

source: Our Vision
de: Unsere Vision
fr: Notre Vision
sw: Maono Yetu

source: To lead pharmaceutical innovation in Africa, making quality medicines more accessible to all.
de: Führend in der pharmazeutischen Innovation in Afrika zu sein und qualitativ hochwertige Medikamente für alle besser zugänglich zu machen.
fr: Être à la tête de l'innovation pharmaceutique en Afrique, rendant les médicaments de qualité plus accessibles à tous.
sw: Kuongoza katika ubunifu wa dawa barani Afrika, na kufanya dawa bora zipatikane kwa wote.

source: Our Mission
de: Unsere Mission
fr: Notre Mission
sw: Dhamira Yetu

source: To improve access and availability of medicines in African communities.
de: Den Zugang und die Verfügbarkeit von Medikamenten in afrikanischen Gemeinschaften zu verbessern.
fr: Améliorer l'accès et la disponibilité des médicaments dans les communautés africaines.
sw: Kuboresha upatikanaji na upatikanaji wa dawa katika jamii za Kiafrika.

source: Reduced Stockouts
de: Weniger Lieferengpässe
fr: Réduction des ruptures de stock
sw: Kupungua kwa Ukosefu wa Dawa

source: Health facilities now have consistent access to essential drugs, improving patient outcomesReduced Stockouts.
de: Gesundheitseinrichtungen haben nun konstanten Zugang zu wichtigen Medikamenten, was die Behandlungsergebnisse verbessert und Lieferengpässe reduziert.
fr: Les établissements de santé disposent désormais d'un accès constant aux médicaments essentiels, améliorant les résultats pour les patients.

source: Improved Cash Flow
de: Verbesserter Cashflow
fr: Amélioration des flux de trésorerie
sw: Mtiririko wa Fedha Ulioboreshwa

source: Improved HFs economic state by cutting down costs
de: Verbesserung des wirtschaftlichen Zustands von Gesundheitseinrichtungen durch Kostensenkung
fr: Amélioration de l'état économique des établissements de santé en réduisant les coûts.
sw: Kuboresha hali ya kifedha ya vituo vya afya kwa kupunguza gharama

source: Fewer Counterfeits
de: Weniger Fälschungen
fr: Moins de contrefaçons
sw: Kupungua kwa Dawa Bandia

source: Our focus on authentic products has drastically lowered the circulation of counterfeit medications.
de: Unser Fokus auf authentische Produkte hat die Verbreitung gefälschter Medikamente drastisch reduziert.
fr: Notre concentration sur des produits authentiques a considérablement réduit la circulation des médicaments contrefaits.
sw: Mtazamo wetu kwa bidhaa halisi umepunguza kwa kiasi kikubwa usambazaji wa dawa bandia.

source: Outcomes
de: Ergebnisse
fr: Résultats
sw: Matokeo

source: Our innovations drive measurable impact
de: Unsere Innovationen erzielen messbare Ergebnisse
fr: Nos innovations génèrent un impact mesurable
sw: Ubunifu wetu unaleta athari zinazoweza kupimika

source: Dawa Mkononi revolutionizes medicine distribution, ensuring availability, boosting cash flow, cutting costs, and improving healthcare access.
de: Dawa Mkononi revolutioniert die Medikamentenverteilung, stellt Verfügbarkeit sicher, verbessert den Cashflow, senkt Kosten und verbessert den Zugang zur Gesundheitsversorgung.
fr: Dawa Mkononi révolutionne la distribution de médicaments, garantissant leur disponibilité, améliorant les flux de trésorerie, réduisant les coûts et améliorant l'accès aux soins de santé.
sw: Dawa Mkononi inaleta mapinduzi katika usambazaji wa dawa, kuhakikisha upatikanaji, kuimarisha mtiririko wa fedha, kupunguza gharama, na kuboresha upatikanaji wa huduma za afya.

source: Our Impact
de: Unsere Wirkung
fr: Notre Impact
sw: Athari Zetu

source: Patients Served by 2024
de: Patienten, die bis 2024 versorgt wurden
fr: Patients servis d'ici 2024
sw: Wagonjwa Waliohudumiwa Kufikia 2024

source: Health Facilities Reached
de: Erreichte Gesundheitseinrichtungen
fr: Établissements de santé touchés
sw: Vituo vya Afya Vilivyofikiwa

source: Credit Financing Provided
de: Kreditfinanzierung bereitgestellt
fr: Financement par crédit fourni
sw: Fedha za Mikopo Zilizotolewa

source: We are proud of our works
de: Wir sind stolz auf unsere Arbeit
fr: Nous sommes fiers de nos réalisations
sw: Tunajivunia kazi zetu

source: Improving Access to Medicines in Africa.
de: Verbesserung des Zugangs zu Medikamenten in Afrika.
fr: Améliorer l'accès aux médicaments en Afrique.
sw: Kuboresha Upatikanaji wa Dawa Barani Afrika.

source: Active customers.
de: Aktive Kunden.
fr: Clients actifs.
sw: Wateja Hai.

source: Average Order value
de: Durchschnittlicher Bestellwert
fr: Valeur moyenne des commandes
sw: Thamani ya Kawaida ya Agizo

source: Sales Jan-Oct 2024
de: Verkäufe Jan-Okt 2024
fr: Ventes de janvier à octobre 2024
sw: Mauzo Jan-Okt 2024

source: Our Team
de: Unser Team
fr: Notre Équipe
sw: Timu Yetu

source: Dedicated to transforming healthcare
de: Engagiert für die Transformation des Gesundheitswesens
fr: Dédié à transformer les soins de santé
sw: Tumejitolea kubadilisha huduma za afya

source: Pharmaceuticals At Your Fingertips
de: Pharmazeutika in Ihren Händen
fr: Les produits pharmaceutiques à portée de main
sw: Dawa Zinazopatikana kwa Urahisi

source: About Us
de: Über uns
fr: À propos de nous
sw: Kuhusu Sisi

source: Contact Us
de: Kontaktieren Sie uns
fr: Contactez-nous
sw: Wasiliana Nasi

source: Dawa Mkononi App is available in your favourite store
de: Die Dawa Mkononi App ist in Ihrem bevorzugten Store verfügbar
fr: L'application Dawa Mkononi est disponible dans votre boutique préférée
sw: App ya Dawa Mkononi inapatikana kwenye duka unalopenda

source: Download it now from your favourite store.
de: Laden Sie sie jetzt aus Ihrem bevorzugten Store herunter.
fr: Téléchargez-la dès maintenant depuis votre boutique préférée.
sw: Pakua sasa kutoka kwenye duka unalopenda.

source: Are you in need of bulk supply of pharmaceuticals?
de: Benötigen Sie Großlieferungen von Pharmazeutika?
fr: Avez-vous besoin d'une fourniture en gros de produits pharmaceutiques ?
sw: Unahitaji usambazaji wa dawa kwa wingi?

source: Our Contacts
de: Unsere Kontakte
fr: Nos Contacts
sw: Mawasiliano Yetu

source: Pharmacy Name
de: Apothekenname
fr: Nom de la Pharmacie
sw: Jina la Duka la Dawa

source: Pharmacist Name
de: Name des Apothekers
fr: Nom du Pharmacien
sw: Jina la Mfamasia

source: Superintedent Pharmacist
de: Leitender Apotheker
sw: Mfamasia Mkuu

source: Time Of Operation
de: Betriebszeiten
fr: Heures d'Ouverture
sw: Saa za Kazi

source: HEAD OFFICE
de: HAUPTSITZ
fr: SIÈGE SOCIAL
sw: MAKAO MAKUU

source: BRANCH OFFICE
de: NIEDERLASSUNG
fr: BUREAU ANNEXE
sw: OFISI YA TAWI

source: Phone
de: Telefon
fr: Téléphone
sw: Simu

source: DID YOU KNOW?
de: WUSSTEN SIE SCHON?
fr: LE SAVIEZ-VOUS ?
sw: JE, WAJUA?

source: Health facilities struggle with working capital, causing stockouts and compromising care
de: Gesundheitseinrichtungen kämpfen mit Betriebskapital, was zu Lieferengpässen führt und die Versorgung beeinträchtigt.
fr: Les établissements de santé rencontrent des difficultés de fonds de roulement, provoquant des ruptures de stock et compromettant les soins
sw: Vituo vya afya vinakumbwa na changamoto za mtaji wa kazi, hali inayosababisha ukosefu wa dawa na kuathiri huduma.

source: Health facilities face stock outs on essential drugs
de: Gesundheitseinrichtungen haben Engpässe bei wichtigen Medikamenten
fr: Les établissements de santé font face à des ruptures de stock sur les médicaments essentiels
sw: Vituo vya afya vinakumbwa na ukosefu wa dawa muhimu

source: Loans given to HCF, in Tanzania
de: Kredite an HCF in Tansania vergeben
fr: Prêts accordés aux établissements de santé, en Tanzanie
sw: Mikopo iliyotolewa kwa Vituo vya Huduma za Afya nchini Tanzania

source: Our Approach to Improving Healthcare Supply Chains
de: Unser Ansatz zur Verbesserung der Versorgungsketten im Gesundheitswesen
fr: Notre Approche pour Améliorer les Chaînes d'Approvisionnement en Soins de Santé
sw: Mbinu Yetu ya Kuboresha Minyororo ya Usambazaji wa Huduma za Afya

source: Credit Financing
de: Kreditfinanzierung
fr: Financement par Crédit
sw: Ufadhili wa Mikopo

source: Helping healthcare providers manage cash flow efficiently.
de: Unterstützung von Gesundheitsdienstleistern bei der effizienten Verwaltung ihres Cashflows.
fr: Aider les prestataires de santé à gérer efficacement leur trésorerie.
sw: Kusaidia watoa huduma za afya kusimamia mtiririko wa fedha kwa ufanisi.

source: Extensive Product Range
de: Umfangreiches Produktsortiment
fr: Large Gamme de Produits
sw: Aina Nyingi za Bidhaa

source: Access to high-quality, authentic medications.
de: Zugang zu hochwertigen, authentischen Medikamenten.
fr: Accès à des médicaments authentiques et de haute qualité.
sw: Upatikanaji wa dawa bora na halisi.

source: Data-Driven Ordering
de: Datenbasierte Bestellung
fr: Commandes Basées sur les Données
sw: Kuagiza Kunakotegemea Takwimu

source: Simplifying procurement with intelligent insights.
de: Vereinfachung der Beschaffung durch intelligente Einblicke.
fr: Simplifier les achats grâce à des analyses intelligentes.
sw: Kurahisisha ununuzi kwa maarifa mahiri.

source: On-time Delivery
de: Pünktliche Lieferung
fr: Livraison à Temps
sw: Uwasilishaji Kwa Wakati

source: Timely distribution to avoid stockouts.
de: Rechtzeitige Verteilung, um Lieferengpässe zu vermeiden.
fr: Distribution ponctuelle pour éviter les ruptures de stock.
sw: Usambazaji kwa wakati ili kuepuka ukosefu wa bidhaa.

source: Authentic Products
de: Authentische Produkte
fr: Produits Authentiques
sw: Bidhaa Halisi

source: Reducing the risk of counterfeit medicines.
de: Verringerung des Risikos gefälschter Medikamente.
fr: Réduction des risques de médicaments contrefaits.
sw: Kupunguza hatari ya dawa bandia.

source: Gross Margin:
de: Bruttomarge:
fr: Marge Brute :
sw: Pato la Jumla:

source: Warehouse Partership
de: Lagerhaus-Partnerschaft
sw: Ushirikiano wa Maghala

source: Gross Margin: In house inventory
de: Bruttomarge: Eigenlagerbestand
sw: Pato la Jumla: Bidhaa za Ghala la Ndani

source: How We Operate?
de: Wie wir arbeiten
fr: Comment Fonctionnons-Nous ?
sw: Tunavyofanya Kazi?

source: Manufacturing & Importers
de: Herstellung & Importeure
fr: Fabricants et Importateurs
sw: Utengenezaji na Waagizaji

source: We source quality products directly from manufacturers and importers.
de: Wir beziehen Qualitätsprodukte direkt von Herstellern und Importeuren.
fr: Nous approvisionnons directement en produits de qualité auprès des fabricants et des importateurs.
sw: Tunapata bidhaa bora moja kwa moja kutoka kwa wazalishaji na waagizaji.

source: Fulfillment, Data Processing & Credit Scoring
de: Erfüllung, Datenverarbeitung & Kreditbewertung
fr: Exécution, Traitement des Données et Évaluation du Crédit
sw: Utimilifu, Uchakataji wa Takwimu na Upimaji wa Mikopo

source: We manage orders, process data, and provide credit scoring for retailer financing.
de: Wir verwalten Bestellungen, verarbeiten Daten und bieten Kreditbewertungen für die Finanzierung von Einzelhändlern an.
fr: Nous gérons les commandes, traitons les données et fournissons une évaluation de crédit pour le financement des détaillants.
sw: Tunasimamia maagizo, kuchakata data, na kutoa upimaji wa mikopo kwa ajili ya ufadhili wa wauzaji.

source: Stock Financing
de: Lagerfinanzierung
fr: Financement des Stocks
sw: Ufadhili wa Bidhaa

source: We offer flexible financing options to help retailers maintain stock.
de: Wir bieten flexible Finanzierungsoptionen, um Einzelhändlern zu helfen, ihren Lagerbestand zu halten.
fr: Nous offrons des options de financement flexibles pour aider les détaillants à maintenir leurs stocks.
sw: Tunatoa chaguo za ufadhili zinazobadilika kusaidia wauzaji kudumisha bidhaa.

source: Retailer Distribution
de: Einzelhändler-Verteilung
fr: Distribution aux Détaillants
sw: Usambazaji kwa Wauzaji

source: We distribute products to pharmacies, hospitals, clinics, and other healthcare facilities.
de: Wir verteilen Produkte an Apotheken, Krankenhäuser, Kliniken und andere Gesundheitseinrichtungen.
fr: Nous distribuons des produits aux pharmacies, hôpitaux, cliniques et autres établissements de santé.
sw: Tunasambaza bidhaa kwa maduka ya dawa, hospitali, kliniki, na vituo vingine vya huduma za afya.

source: Our Dawa Mkononi app empowers healthcare providers
de: Unsere Dawa Mkononi App stärkt Gesundheitsdienstleister
fr: Notre application Dawa Mkononi donne du pouvoir aux prestataires de soins de santé
sw: App yetu ya Dawa Mkononi inawawezesha watoa huduma za afya

source: Stock List
de: Bestandsliste
fr: Liste de Stock
sw: Orodha ya Bidhaa

source: Digitize your stock process,by having a virtual paper for your convenience
de: Digitalisieren Sie Ihren Lagerprozess, indem Sie ein virtuelles Dokument für Ihren Komfort verwenden.
sw: Kidigitali mchakato wako wa bidhaa, kwa kuwa na karatasi ya mtandaoni kwa urahisi wako

source: Reorder
de: Nachbestellung
fr: Recommander
sw: Agiza Tena

source: Hustle free reordering of medications from your previous orders
de: Stressfreie Nachbestellung von Medikamenten aus Ihren früheren Bestellungen
fr: Recommande sans tracas des médicaments à partir de vos commandes précédentes
sw: Kuagiza tena dawa bila usumbufu kutoka kwa maagizo yako ya awali

source: Payment
de: Bezahlung
fr: Paiement
sw: Malipo

source: Pay instantly and securely using Selcom Pay during checkout
de: Bezahlen Sie sofort und sicher mit Selcom Pay beim Checkout
fr: Payez instantanément et en toute sécurité avec Selcom Pay lors de la commande
sw: Lipa papo hapo na kwa usalama ukitumia Selcom Pay wakati wa kulipia

source: Delivery
de: Lieferung
fr: Livraison
sw: Uwasilishaji

source: We provide fast and reliable deliveries to your facility
de: Wir bieten schnelle und zuverlässige Lieferungen an Ihre Einrichtung
fr: Nous offrons des livraisons rapides et fiables à votre établissement
sw: Tunatoa usafirishaji wa haraka na wa kuaminika hadi kituo chako

source: Orders
de: Bestellungen
fr: Commandes
sw: Maagizo

source: Review your previous orders to help you manage your stock well
de: Überprüfen Sie Ihre früheren Bestellungen, um Ihren Bestand gut zu verwalten
fr: Consultez vos commandes précédentes pour mieux gérer vos stocks
sw: Pitia maagizo yako ya awali ili kukusaidia kusimamia bidhaa zako vizuri

source: Categories
de: Kategorien
fr: Catégories
sw: Jamii

source: Browse through different categories to easily find the medications.
de: Durchsuchen Sie verschiedene Kategorien, um die Medikamente leicht zu finden.
fr: Parcourez différentes catégories pour trouver facilement les médicaments.
sw: Pitia aina mbalimbali za bidhaa kwa urahisi kupata dawa unazohitaji.

source: Trusted by over 2K+ clients across Africa
de: Vertrauen von über 2.000 Kunden in ganz Afrika
fr: Fait confiance à plus de 2 000 clients à travers l'Afrique
sw: Inategemewa na zaidi ya wateja 2K+ barani Afrika

source: At the heart of our mission to transform healthcare access is a team of passionate and experienced professionals.
de: Im Mittelpunkt unserer Mission, den Zugang zur Gesundheitsversorgung zu transformieren, steht ein Team leidenschaftlicher und erfahrener Fachleute.
fr: Au cœur de notre mission de transformation de l'accès aux soins se trouve une équipe de professionnels passionnés et expérimentés.
sw: Moyo wa dhamira yetu ya kubadilisha upatikanaji wa huduma za afya ni timu ya wataalamu walio na shauku na uzoefu.
